app/controllers/tests_controller.rb

INSERT INTO `tests` (`created_at`, `updated_at`, `value`) VALUES ('2014-09-23 13:54:31', '2014-09-23 13:54:31', '%5B%7B%22url%22%3A%22http%3A//www.pazienti.it%22%2C%22expect%22%3A%22%22%2C%22%24%24hashKey%22%3A%22003%22%7D%5D')
---
  def create
    @test = Test.create!(test_params)

SELECT `tests`.* FROM `tests` WHERE `tests`.`uid` = 928 LIMIT 1
---
  def set_test
    @test = Test.find_by_uid(params[:id])